In [4]:
import pandas as pd
import numpy as np

In [6]:
 df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                          pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [9]:
df.dropna(axis=1, how='any') # all 전부 다 null 값일 때 드롭, 1은 행 0은 row

       name
0    Alfred
1    Batman
2  Catwoman

In [10]:
df.dropna(axis=0, how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [11]:
df.dropna(axis=0, how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [12]:
df.fillna(0)

       name        toy                 born
0    Alfred          0                    0
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    0

In [13]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                   columns=list('ABCD'))

In [14]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3} # 결측치일 때 특정 값으로 넣어주기를 원할 때.

In [15]:
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [17]:
df.fillna(value=values).mean()

A    0.75
B    2.50
C    2.00
D    2.50
dtype: float64

In [19]:
df.fillna(df['D'].mean()) # 특정 평균으로 결측치를 채워줄 때

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [20]:
fill_na_value = df['D'].median()
fill_na_value

2.5

In [21]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [24]:
df.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64

In [25]:
df.notnull().sum()

A    1
B    3
C    0
D    4
dtype: int64